nowhard/STM32_PILORAMA/freertos_test/menu/menu.c
	if(drv.move_type_flag!=MOVE_TYPE_NONE)//аварийная остановка привода при движении
	{
		if((current_key==KEY_C)||(current_key==KEY_C_LONG))
		{
			Drive_Stop(STOP_USER,FROM_TASK);
			buzzer_set_buzz(BUZZER_EFFECT_LONG_BEEP,BUZZER_ON,FROM_TASK);
		}
	}
	else
	{
		if(drv.error_flag==DRIVE_ERR)
		{
			if(current_key==KEY_C_LONG) //очистим поле
			{
				Menu_Input_Field_Clear(&input_buf);

					switch(drv.stop_type)
					{
						case STOP_HI_SENSOR:
						{

						}
						break;

						case STOP_LO_SENSOR:
						{

						}
						break;

						case STOP_INVERTOR_ERROR:
						{
							Drive_Reset();
						}
						break;

						case STOP_CONTROLLER_FAULT:
						{
							//???
						}
						break;

						default:
						{

						}
						break;
					}
				drv.error_flag=DRIVE_OK;
				buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
			}
		}
		else
		{
			switch(currentMenuItem->Select)
			{
				case MENU_ROOT:
				{
					switch(current_key)
					{
						case KEY_A_LONG:
						{
							Menu_Child();
							buzzer_set_buzz(BUZZER_EFFECT_LONG_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_C_LONG://очистим поле
						{
							Menu_Input_Field_Clear(&input_buf);
							if(drv.error_flag==DRIVE_ERR)
							{
								switch(drv.stop_type)
								{
									case STOP_HI_SENSOR:
									{

									}
									break;

									case STOP_LO_SENSOR:
									{

									}
									break;

									case STOP_INVERTOR_ERROR:
									{
										Drive_Reset();
									}
									break;

									case STOP_CONTROLLER_FAULT:
									{
										//???
									}
									break;

									default:
									{

									}
									break;
								}
							}
							drv.error_flag=DRIVE_OK;
							buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_POINT_LONG://ввод значения
						{
							int16_t move_val=0;
							switch(input_buf.sign)
							{
								case '+':
								{
									if(Menu_Input_Buf_To_Int(&input_buf,&move_val,MENU_ROOT_MIN_VAL,MENU_ROOT_MAX_VAL)==INPUT_OK)
									{

										//исправить ввод значения больше максимума и меньше минимума

										if((Drive_Impulse_To_MM_Absolute(drv.current_position)+move_val)>MENU_ABS_MAX_VAL)
										{
											buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
											Indicator_Blink_Set(IND_2,0xFF,2);
											break;
										}

										//test move val for correct
										if(drv.bkp_reg->F_07_cal_stop_up>=move_val)
										{
											buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
											Indicator_Blink_Set(IND_2,0xFF,2);
											break;
										}

										if(Drive_Set_Position(MOVE_TYPE_RELATIVE_UP, move_val)!=DRIVE_OK)
										{
											Drive_Stop(STOP_CONTROLLER_FAULT,FROM_TASK);
											buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
										}
										else
										{
											buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
										}
									}
									else
									{
										buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
									}
								}
								break;

								case '-':
								{
									if(Menu_Input_Buf_To_Int(&input_buf,&move_val,MENU_ROOT_MIN_VAL,MENU_ROOT_MAX_VAL)==INPUT_OK)
									{
										//исправить ввод значения больше максимума и меньше минимума

										if(((int16_t)Drive_Impulse_To_MM_Absolute(drv.current_position)+move_val)<MENU_ABS_MIN_VAL)
										{
											buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
											Indicator_Blink_Set(IND_2,0xFF,2);
											break;
										}

										//test move val for correct

										if(drv.bkp_reg->F_06_cal_stop_down>=(-move_val))
										{
											buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
											Indicator_Blink_Set(IND_2,0xFF,2);
											break;
										}

										if(Drive_Set_Position(MOVE_TYPE_RELATIVE_DOWN, move_val)!=DRIVE_OK)
										{
											Drive_Stop(STOP_CONTROLLER_FAULT,FROM_TASK);
										}
										else
										{
											buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
										}
									}
									else
									{
										buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
									}
								}
								break;

								case ' ':
								{
									if(Menu_Input_Buf_To_Int(&input_buf,&move_val,MENU_ROOT_MIN_VAL,MENU_ROOT_MAX_VAL)==INPUT_OK)
									{
										int16_t temp=move_val-Drive_Impulse_To_MM_Absolute(drv.current_position);

										if(temp>=0)
										{
											if(drv.bkp_reg->F_07_cal_stop_up>=temp)
											{
												buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
												Indicator_Blink_Set(IND_2,0xFF,2);
												break;
											}
										}
										else
										{
											if(drv.bkp_reg->F_06_cal_stop_down>=(-temp))
											{
												buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
												Indicator_Blink_Set(IND_2,0xFF,2);
												break;
											}
										}


										if(Drive_Set_Position(MOVE_TYPE_ABSOLUTE, move_val)!=DRIVE_OK)
										{
											Drive_Stop(STOP_CONTROLLER_FAULT,FROM_TASK);
										}
										else
										{
											buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
										}
									}
									else
									{
										buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
									}
								}
								break;

								default :
								{
									//sign incorrect
								}
								break;
							}
						}
						break;

						case KEY_B://функция BACK
						{
							switch(drv.function_back_flag)
							{
								case DRIVE_BACK_POS_DOWN:
								{
									uint32_t temp_imp_pos=Drive_MM_To_Impulse_Absolute(drv.bkp_reg->F_04_function_back);
									if(temp_imp_pos<=drv.current_position)
									{
										buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
									}
									else
									{
										drv.function_back_flag=DRIVE_BACK_POS_UP;
										drv.function_back_temp_position=drv.current_position;
										//go to UP  position
										if(Drive_Set_Position_Imp_Absolute(temp_imp_pos)!=DRIVE_OK)
										{
											buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
											drv.function_back_flag=DRIVE_BACK_POS_DOWN;
										}
										else
										{
											buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
										}
									}
								}
								break;

								case DRIVE_BACK_POS_UP:
								{
									drv.function_back_flag=DRIVE_BACK_POS_DOWN;
									if(Drive_Set_Position_Imp_Absolute(drv.function_back_temp_position)!=DRIVE_OK)
									{
										buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
									}
									else
									{
										buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
									}
								}
								break;

								default:
								{
									drv.function_back_flag=DRIVE_BACK_POS_DOWN;
								}
								break;
							}

