nowhard/STM32_PILORAMA/freertos_test/menu/menu.c
						}
						break;

						case KEY_STAR_LONG://движение вниз
						{
							if(drv.limitation_flag!=DRIVE_LIMITATION_ONLY_UP)
							{
								Drive_Set_Speed(DRIVE_SPEED_HI);
								Drive_Start(DRIVE_DIRECTION_DOWN);
								buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
							}
						}
						break;

						case KEY_SHARP_LONG://движение вверх
						{
							if(drv.limitation_flag!=DRIVE_LIMITATION_ONLY_DOWN)
							{
								Drive_Set_Speed(DRIVE_SPEED_HI);
								Drive_Start(DRIVE_DIRECTION_UP);
								buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
							}
						}
						break;

						case KEY_STAR_LONG_RELEASE://стоп движение вниз
						{
							Drive_Stop(STOP_MANUAL_CONTROL,FROM_TASK);
							buzzer_set_buzz(BUZZER_EFFECT_2_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_SHARP_LONG_RELEASE://стоп движение вверх
						{
							Drive_Stop(STOP_MANUAL_CONTROL,FROM_TASK);
							buzzer_set_buzz(BUZZER_EFFECT_2_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_B_LONG://функция BACK запомнить значение
						{
							uint16_t temp=Drive_Impulse_To_MM_Absolute(drv.current_position);
							if((temp>=MENU_F04_MIN_VAL)&&(temp<=MENU_F04_MAX_VAL))
							{
								Backup_SRAM_Write_Reg(&drv.bkp_reg->F_04_function_back,&temp,sizeof(uint16_t));
								buzzer_set_buzz(BUZZER_EFFECT_2_BEEP,BUZZER_ON,FROM_TASK);
							}
							else
							{
								buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
								Indicator_Blink_Set(IND_2,0xFF,2);
								//input error
							}
						}
						break;

						default:
						{
							Menu_Input_Field(current_key,INPUT_WITH_POINT|INPUT_WITH_SIGN,&input_buf,MENU_ROOT_MIN_VAL,MENU_ROOT_MAX_VAL);
						}
						break;
					}
				}
				break;

				case MENU_F_01:
				{
					switch(current_key)
					{
						case KEY_C_LONG:
						{
							Menu_Parent();
							buzzer_set_buzz(BUZZER_EFFECT_LONG_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_A:
						{
							Menu_Next();
							buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_POINT_LONG://запомним значение
						{
							//int16_t temp_val;
							if(Menu_Input_Buf_To_Int(&input_buf,&temp_mm_imp.mm,MENU_F01_MIN_VAL,MENU_F01_MAX_VAL)==INPUT_OK)
							{
								temp_mm_imp.imp=drv.current_position;
								Backup_SRAM_Write_Reg(&drv.bkp_reg->F_01_cal_down,&temp_mm_imp,sizeof(struct mm_imp));
								buzzer_set_buzz(BUZZER_EFFECT_2_BEEP,BUZZER_ON,FROM_TASK);
							}
							else
							{
								buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
								Indicator_Blink_Set(IND_2,0xFF,2);
							}
						}
						break;

						default:
						{
							Menu_Input_Field(current_key,INPUT_WITH_POINT,&input_buf,MENU_F01_MIN_VAL,MENU_F01_MAX_VAL);
						}
						break;
					}
				}
				break;

				case MENU_F_02:
				{
					switch(current_key)
					{
						case KEY_C_LONG:
						{
							Menu_Parent();
							buzzer_set_buzz(BUZZER_EFFECT_LONG_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_A:
						{
							Menu_Next();
							buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_POINT_LONG://запомним значение
						{
							int16_t temp_val;
							if(Menu_Input_Buf_To_Int(&input_buf,&temp_mm_imp.mm,MENU_F02_MIN_VAL,MENU_F02_MAX_VAL)==INPUT_OK)
							{
								temp_mm_imp.imp=drv.current_position;
								Backup_SRAM_Write_Reg(&drv.bkp_reg->F_02_cal_up,&temp_mm_imp,sizeof(struct mm_imp));
								buzzer_set_buzz(BUZZER_EFFECT_2_BEEP,BUZZER_ON,FROM_TASK);
							}
							else
							{
								buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
								Indicator_Blink_Set(IND_2,0xFF,2);
								//input error
							}
						}
						break;

						default:
						{
							Menu_Input_Field(current_key,INPUT_WITH_POINT,&input_buf,MENU_F02_MIN_VAL,MENU_F02_MAX_VAL);
						}
						break;
					}
				}
				break;

				case MENU_F_03:
				{
					switch(current_key)
					{
						case KEY_C_LONG:
						{
							Menu_Parent();
							buzzer_set_buzz(BUZZER_EFFECT_LONG_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_A:
						{
							Menu_Next();
							buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_POINT_LONG://запомним значение
						{
							if(Menu_Input_Buf_To_Int(&input_buf,&temp_mm_imp.mm,MENU_F03_MIN_VAL,MENU_F03_MAX_VAL)==INPUT_OK)
							{
								temp_mm_imp.imp=drv.current_position;
								Backup_SRAM_Write_Reg(&drv.bkp_reg->F_03_cal_syncro,&temp_mm_imp,sizeof(struct mm_imp));
								buzzer_set_buzz(BUZZER_EFFECT_2_BEEP,BUZZER_ON,FROM_TASK);
							}
							else
							{
								buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
								Indicator_Blink_Set(IND_2,0xFF,2);
								//input error
							}
						}
						break;

						default:
						{
							Menu_Input_Field(current_key,INPUT_WITH_POINT,&input_buf,MENU_F03_MIN_VAL,MENU_F03_MAX_VAL);
						}
						break;
					}
				}
				break;

				case MENU_F_04:
				{
					switch(current_key)
					{
						case KEY_C_LONG:
						{
							Menu_Parent();
							buzzer_set_buzz(BUZZER_EFFECT_LONG_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_A:
						{
							Menu_Next();
							buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_POINT_LONG://запомним значение
						{
							if(Menu_Input_Buf_To_Int(&input_buf,&temp_val,MENU_F04_MIN_VAL,MENU_F04_MAX_VAL)==INPUT_OK)
							{
								Backup_SRAM_Write_Reg(&drv.bkp_reg->F_04_function_back,&temp_val,sizeof(uint16_t));
								buzzer_set_buzz(BUZZER_EFFECT_2_BEEP,BUZZER_ON,FROM_TASK);
							}
							else
							{
								buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
								Indicator_Blink_Set(IND_2,0xFF,2);
								//input error
							}
						}
						break;

						default:
						{
							Menu_Input_Field(current_key,INPUT_WITH_POINT,&input_buf,MENU_F04_MIN_VAL,MENU_F04_MAX_VAL);
						}
						break;
					}
				}
				break;

				case MENU_F_05:
				{
					switch(current_key)
					{
						case KEY_C_LONG:
						{
							Menu_Parent();
							buzzer_set_buzz(BUZZER_EFFECT_LONG_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_A:
						{
							Menu_Next();
							buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_POINT_LONG://запомним значение
						{
							if(Menu_Input_Buf_To_Int(&input_buf,&temp_val,MENU_F05_MIN_VAL,MENU_F05_MAX_VAL)==INPUT_OK)
							{
								Backup_SRAM_Write_Reg(&drv.bkp_reg->F_05_cal_speed_down,&temp_val,sizeof(uint16_t));
								buzzer_set_buzz(BUZZER_EFFECT_2_BEEP,BUZZER_ON,FROM_TASK);
							}
							else
							{
								buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
								Indicator_Blink_Set(IND_2,0xFF,2);
								//input error
							}
						}
						break;

						default:
						{
							Menu_Input_Field(current_key,INPUT_WITH_POINT,&input_buf,MENU_F05_MIN_VAL,MENU_F05_MAX_VAL);
						}
						break;
					}
				}
				break;

