nowhard/STM32_PILORAMA/freertos_test/menu/menu.c
				case MENU_F_06:
				{
					switch(current_key)
					{
						case KEY_C_LONG:
						{
							Menu_Parent();
							buzzer_set_buzz(BUZZER_EFFECT_LONG_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_A:
						{
							Menu_Next();
							buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_POINT_LONG://запомним значение
						{
							int16_t temp_val;
							if(Menu_Input_Buf_To_Int(&input_buf,&temp_val,MENU_F06_MIN_VAL,MENU_F06_MAX_VAL)==INPUT_OK)
							{
								Backup_SRAM_Write_Reg(&drv.bkp_reg->F_06_cal_stop_down,&temp_val,sizeof(uint16_t));
								buzzer_set_buzz(BUZZER_EFFECT_2_BEEP,BUZZER_ON,FROM_TASK);
							}
							else
							{
								buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
								Indicator_Blink_Set(IND_2,0xFF,2);
								//input error
							}
						}
						break;

						default:
						{
							Menu_Input_Field(current_key,INPUT_WITH_POINT,&input_buf,MENU_F06_MIN_VAL,MENU_F06_MAX_VAL);
						}
						break;
					}
				}
				break;


				case MENU_F_07:
				{
					switch(current_key)
					{
						case KEY_C_LONG:
						{
							Menu_Parent();
							buzzer_set_buzz(BUZZER_EFFECT_LONG_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_A:
						{
							selectedMenuItem = (menuItem*)&m_s1i1;
							dispMenu();
							buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
						}
						break;

						case KEY_POINT_LONG://запомним значение
						{
							int16_t temp_val;
							if(Menu_Input_Buf_To_Int(&input_buf,&temp_val,MENU_F06_MIN_VAL,MENU_F06_MAX_VAL)==INPUT_OK)
							{
								Backup_SRAM_Write_Reg(&drv.bkp_reg->F_07_cal_stop_up,&temp_val,sizeof(uint16_t));
								buzzer_set_buzz(BUZZER_EFFECT_2_BEEP,BUZZER_ON,FROM_TASK);
							}
							else
							{
								buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
								Indicator_Blink_Set(IND_2,0xFF,2);
								//input error
							}
						}
						break;

						default:
						{
							Menu_Input_Field(current_key,INPUT_WITH_POINT,&input_buf,MENU_F07_MIN_VAL,MENU_F07_MAX_VAL);
						}
						break;
					}
				}
				break;
			}
	   }
	}
}


#define DISPLAY_DELAY	10
void MenuHandler( void *pvParameters )
{
	uint16_t key;
	uint8_t clr_indicator_msg, display_counter=0;
    startMenu();
    while(1)
    {
		if( (xKeyQueue != 0)&&(uxQueueMessagesWaiting(xKeyQueue)) )
		 {
			 if( xQueueReceive( xKeyQueue, &( key ), ( portTickType ) 10 ) )
			 {
				 Menu_Handle_Key(selectedMenuItem,key);
			 }
		 }

		if( (xClrIndicatorQueue != 0)&&(uxQueueMessagesWaiting(xClrIndicatorQueue)) )
		 {
			 if( xQueueReceive( xClrIndicatorQueue, &( clr_indicator_msg ), ( portTickType ) 10 ) )
			 {
				 if(clr_indicator_msg==MENU_MSG_CLR_INDICATOR)
				 {
					 Menu_Input_Field_Clear(&input_buf);
				 }
			 }
		 }
		display_counter++;
		if((selectedMenuItem->Select==MENU_ROOT)&&(display_counter>=DISPLAY_DELAY))
		{
			display_counter=0x0;
			if(drv.error_flag==DRIVE_OK)
			{
				if(Menu_Input_Int_To_Buf(Drive_Impulse_To_MM_Absolute(drv.current_position),&abs_buf, MENU_ABS_MIN_VAL,MENU_ABS_MAX_VAL)!=INPUT_ERR)
				{
					//Menu_Input_Buf_To_Indicator(&abs_buf,IND_1);
				}
				Menu_Input_Buf_To_Indicator(&abs_buf,IND_1);

				switch(drv.move_type_flag)
				{
					case MOVE_TYPE_RELATIVE_UP:
					{
						if(Menu_Input_Int_To_Buf(Drive_Impulse_To_MM(drv.dest_position-drv.current_position),&abs_buf, MENU_ABS_MIN_VAL,MENU_ABS_MAX_VAL)!=INPUT_ERR)
						{
//							Menu_Input_Buf_To_Indicator(&abs_buf,IND_2);
						}
						Menu_Input_Buf_To_Indicator(&abs_buf,IND_2);
					}
					break;

					case MOVE_TYPE_RELATIVE_DOWN:
					{
						if(Menu_Input_Int_To_Buf(Drive_Impulse_To_MM(drv.current_position-drv.dest_position),&abs_buf, MENU_ABS_MIN_VAL,MENU_ABS_MAX_VAL)!=INPUT_ERR)
						{
//							abs_buf.sign='-';
//							Menu_Input_Buf_To_Indicator(&abs_buf,IND_2);
						}
						abs_buf.sign='-';
						Menu_Input_Buf_To_Indicator(&abs_buf,IND_2);
					}
					break;

					case MOVE_TYPE_ABSOLUTE:
					{
						if(drv.dest_position>=drv.current_position)
						{
							if(Menu_Input_Int_To_Buf(Drive_Impulse_To_MM(drv.dest_position-drv.current_position),&abs_buf, MENU_ABS_MIN_VAL,MENU_ABS_MAX_VAL)!=INPUT_ERR)
							{
								//Menu_Input_Buf_To_Indicator(&abs_buf,IND_2);
							}
							Menu_Input_Buf_To_Indicator(&abs_buf,IND_2);
						}
						else
						{
							if(Menu_Input_Int_To_Buf(Drive_Impulse_To_MM(drv.current_position-drv.dest_position),&abs_buf, MENU_ABS_MIN_VAL,MENU_ABS_MAX_VAL)!=INPUT_ERR)
							{
//								abs_buf.sign='-';
//								Menu_Input_Buf_To_Indicator(&abs_buf,IND_2);
							}
							abs_buf.sign='-';
							Menu_Input_Buf_To_Indicator(&abs_buf,IND_2);
						}
					}
					break;

					default:
					{

					}
				}
			}
			else
			{
				if(drv.error_flag==DRIVE_ERR)
				{
					if((drv.stop_type==STOP_HI_SENSOR)||(drv.stop_type==STOP_LO_SENSOR))
					{
						str_to_ind(IND_1," 5t0P");
					}
					else
					{
						str_to_ind(IND_1,"Err0r");
					}
				}
			}
		}

    	vTaskDelay(10);
    }
}


void Menu_Input_Field_Clear(struct input_buffer *inp_buf)
{
	inp_buf->counter=0;
	inp_buf->sign=' ';
	Menu_Input_Buf_To_Indicator(inp_buf,IND_2);//что то виснет
}

void Menu_Input_Field_Down_Clear(void)
{
	Menu_Input_Field_Clear(&input_buf);
}

#define POINT_POS	4
uint8_t Menu_Input_Buf_To_Indicator(struct input_buffer *inp_buf,uint8_t indicator)
{
	uint8_t temp_buf[INPUT_BUF_LEN]="   0.0";
	int8_t i=0,j=0;

	if(inp_buf->counter==0)
	{
		if(inp_buf->sign=='-')
		{
			str_to_ind(indicator,"-  0.0");
		}
		else
		{
			if(inp_buf->sign=='+')
			{
				str_to_ind(indicator,".  0.0");
			}
			else
			{
				str_to_ind(indicator,"   0.0");
			}

		}
		return INPUT_OK;
	}

	if(inp_buf->counter<=INPUT_STRING_MAX)
	{
		j=5;
		for(i=(inp_buf->counter-1);i>=0;i--)
		{
			temp_buf[j]=inp_buf->buf[i];
			j--;
			if(j==POINT_POS)
			{
				j--;
			}
		}

		if(inp_buf->sign=='-')
		{
			temp_buf[0]='-';
		}
		else
		{
			if(inp_buf->sign=='+')
			{
				temp_buf[0]='.';
			}
		}

