nowhard/STM32_PILORAMA/freertos_test/menu/menu.c
		str_to_ind(indicator,temp_buf);
		return INPUT_OK;
	}
	else
	{
		return INPUT_ERR;
	}
}


uint8_t Menu_Input_Buf_To_Int(struct input_buffer *inp_buf,int16_t *val,int16_t min_value, int16_t max_value)
{
	int16_t result=0;
	int8_t i=0;

	uint16_t dec_mult=1;

	if(inp_buf->counter==0x0)
	{
		*val=0x0;
		return INPUT_OK;
	}

	for(i=(inp_buf->counter-1);i>=0;i--)
	{
		if((inp_buf->buf[i]<'0')||(inp_buf->buf[i]>'9'))
		{
			return INPUT_ERR;
		}

		result+=(inp_buf->buf[i]-0x30)*dec_mult;
		dec_mult*=10;
	}

	if(inp_buf->sign=='-')
	{
		result=-result;
	}

	*val=result;

	if((result<min_value)||(result>max_value))
	{
		return INPUT_ERR;
	}

	return INPUT_OK;
}

uint8_t Menu_Input_Int_To_Buf(int16_t val,struct input_buffer *inp_buf,int16_t min_value, int16_t max_value)
{
	uint8_t tmp_val,error_flag=0;

	if((val>max_value)||(val<min_value))
	{
		//Menu_Input_Field_Clear(inp_buf);

		if(val>max_value)//заполнить буфер
		{
			val=max_value;
		}
		else
		{
			val=min_value;
		}

		//return INPUT_ERR;
		error_flag=0x1;
	}
	//else
//	{
		if(val<0)
		{
			inp_buf->sign='-';
			val=-val;
		}
		else
		{
			inp_buf->sign=' ';
		}

		inp_buf->counter=0;

		uint16_t divider=1000;
		uint8_t temp_val;
		uint8_t del_null_flag=0;

		while(divider!=0)
		{
			temp_val=val/divider;

			if(temp_val<10)
			{
				if((temp_val>0)||(del_null_flag))
				{
					inp_buf->buf[inp_buf->counter]=(temp_val+0x30);
					inp_buf->counter++;
					del_null_flag=0x1;
				}
			}

			val=val%divider;
			divider=divider/10;
		}
//	}
	//Menu_Input_Buf_To_Indicator(inp_buf,IND_2);
		if(error_flag)
		{
			return INPUT_ERR;
		}
		else
		{
			return INPUT_OK;
		}

}

void Menu_Input_Field(uint8_t current_key,uint8_t attributes,struct input_buffer *inp_buf,int16_t min_value, int16_t max_value)
{

	if((current_key>KEY_9)&&(current_key!=KEY_C)&&(current_key!=KEY_STAR)&&(current_key!=KEY_SHARP))
	{
		return;
	}

	if(current_key==KEY_C)//backspace
    {
		if(inp_buf->counter)
		{
			if(inp_buf->counter>0)
			{
				inp_buf->counter--;
			}

			Menu_Input_Buf_To_Indicator(inp_buf,IND_2);
			buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
		}

		return;
    }


	switch(current_key)
	{
		case KEY_STAR://-
		{
			if(attributes&INPUT_WITH_SIGN)
			{
				inp_buf->sign='-';
				Menu_Input_Buf_To_Indicator(inp_buf,IND_2);
				buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
			}
			return;
		}
		break;

		case KEY_SHARP://+
		{
			if(attributes&INPUT_WITH_SIGN)
			{
				inp_buf->sign='+';
				Menu_Input_Buf_To_Indicator(inp_buf,IND_2);
				buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
			}
			return;
		}
		break;
	}


	if(inp_buf->counter>=INPUT_STRING_MAX)
	{
		buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
		Indicator_Blink_Set(IND_2,0xFF,2);
		return;
	}

	switch(current_key)
	{
		case KEY_0:
		{
			if(inp_buf->counter==0)
			{
				return;
			}

			inp_buf->buf[inp_buf->counter]='0';
			buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
		}
		break;

		case KEY_1:
		{
			inp_buf->buf[inp_buf->counter]='1';
			buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
		}
		break;

		case KEY_2:
		{
			inp_buf->buf[inp_buf->counter]='2';
			buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
		}
		break;

		case KEY_3:
		{
			inp_buf->buf[inp_buf->counter]='3';
			buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
		}
		break;

		case KEY_4:
		{
			inp_buf->buf[inp_buf->counter]='4';
			buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
		}
		break;

		case KEY_5:
		{
			inp_buf->buf[inp_buf->counter]='5';
			buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
		}
		break;

		case KEY_6:
		{
			inp_buf->buf[inp_buf->counter]='6';
			buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
		}
		break;

		case KEY_7:
		{
			inp_buf->buf[inp_buf->counter]='7';
			buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
		}
		break;

		case KEY_8:
		{
			inp_buf->buf[inp_buf->counter]='8';
			buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
		}
		break;

		case KEY_9:
		{
			inp_buf->buf[inp_buf->counter]='9';
			buzzer_set_buzz(BUZZER_EFFECT_1_BEEP,BUZZER_ON,FROM_TASK);
		}
		break;

		default:
		{

		}
		break;
	}
	inp_buf->counter++;

	int16_t temp_val;

	if(Menu_Input_Buf_To_Int(inp_buf,&temp_val,min_value,max_value)==INPUT_ERR)//выход за диапазон-удаляем последний введенный символ
	{
		inp_buf->counter--;
		buzzer_set_buzz(BUZZER_EFFECT_3_BEEP,BUZZER_ON,FROM_TASK);
		Indicator_Blink_Set(IND_2,0xFF,2);
	}

	Menu_Input_Buf_To_Indicator(inp_buf,IND_2);
}
